[
    {
        "employer": "Air National Guard",
        "title": "Emergency Management Craftsman",
        "duration": "February 2014 - Present",
        "description": "Drill Status Guardsman. Training Section Non-Commissioned Officer In-Charge. Develop course material for and instruct/equip base populace in Chemical, Biological, Radiological, and Nuclear material. Communicate w/ multiple base agencies to coordinate plans, exercises, and training. Review and update emergency checklists and plans. Maintain and operate CBRN equipment. Recent deployment to Ali Al Salem, Kuwait (Jul '20 - Feb '21). Ability to work in an ever changing and diverse environment."
    },
    {
        "employer": "Authentic Concrete",
        "title": "Concrete Finisher",
        "duration": "March 2021 - December 2021",
        "description": "Communicate with clients to design projects and to deliver a final product. Adaptation to new surrounding in order to develop/strengthen skills. Coordination of people and equipment in order to complete contracts in a timely fashion. Ensure cleanliness of site upon completion of work. Maintian accountability of tools and expenses."
    },
    {
        "employer": "McGhee Tyson ANG",
        "title": "Commander Support Staff (Federal Technician)",
        "duration": "November 2019 - July 2020",
        "description": "Develop order forms for members deployment items. Coordinate with local distributors and supply office to ensure members recieved all items necessary for deployment. Confirm training and medical requirements met for each unit member each month; shedule otherwise. Follow established guidelines and directions from superiors to accomplish day to day tasks."
    },
    {
        "employer": "AutoZone",
        "title": "Cusomer Sales Manager",
        "duration": "January 2016 - June 2019",
        "description": "Led team in day to day operations. Maintain proper audit logs and records. Ensure daily paperwork is completed and filed accordingly. Communicate effectively with employees to ensure customer satisfaction. Diagnose issues with customer vehicles. Keyholder for opening and closing the business."
    }
]